[
  {
    "chunk_id": 1,
    "text": "MPMC final Author: Unknown | Date: 2025-12-27  Magnetic Field Mapper aims to measure and visualize magnetic field variations in real-time using an Arduino Uno.  The system continuously records magnetic field values along the X, Y, and Z axes, with precise timestamps provided by the RTC module.  These readings are saved on the SD card for further analysis.  The collected data is later processed using Python, where graphs are plotted to show the magnetic field intensity and direction over time.  This helps in understanding magnetic fluctuations and identifying anomalies caused by environmental or external factors.  It serves as a practical tool for educational, research, and environmental applications, demonstrating how embedded systems and data visualization can be effectively combined.  We would like to express our deepest gratitude to our project guide, prof.  Samit Karmakar, and the entire Electronics and Communication Engineering department for providing us with the necessary resources.  Magnetic Field Mapper system was successfully developed and tested.  It captures magnetic field variations along the X, Y, and Z axes.  Each reading was accurately timestamped using the DS3231 real-time clock.  The data, when plotted, showed consistent patterns with minimal deviation.  The system can contribute to scientific research and monitoring of geomagnetic phenomena.  It has several practical applications across different fields: Magnetic anomaly detection: Identifying unusual variations in magnetic fields.  Robotic navigation: Assisting autonomous robots in orientation and pathfinding by providing magnetic field-based positional references, especially in GPS-denied environments.  Geomagnetic field mapping: Facilitating large-scale mapping of Earth's magnetic field, which can.  Contribute toscientific research.  The system provides accurate, real-time measurements of magnetic field variations along three axes.  The data can be easily logged, transferred, and visualized, making the system a practical tool for research.  The project successfully demonstrates that low-cost sensors and microcontrollers can be effectively utilized to develop a reliable magnetic field data logging system.  The system has several practical applications across different fields: Geomagnetic field mapping, geomagnetic anomaly detection, robotic navigation, and educational and research experiments.  It can also be used to study electromagnetic concepts and sensor interfacing in electronics and physics labs.  It is limited by nearby magnetic interference and the need for manual data export for analysis.  It was developed by Adafruit, a company based in Barcelona, Spain.  Void loop() { DateTime now = rtc.now(); // Get current date & time sensors_event_t event; mag.getEvent(&event;); // Get magnetic field data.  Serial.print(\"Initializing SD card...\"); if (!SD.begin(chipSelect)) { Serial.println(\"Initialization failed!  \"); while (1); } Serial.  Println(\"SD card ready.  \");while (1) / Initialize SD card Serial.  Print(':');Serial.print(':') // Print to Serial Monitor --- Serial.prints('/'); myFile.open(\"maglog.txt\", FILE_WRITE); if (myFile.print('/') { my file.close(); Serial.write(myFile); } else if (MyFile.isEmpty) { myfile.close() // Log every 2 seconds 13.  delay(2000); // Logevery 2 seconds 12.  delay (2000) 13.delay(2000) import pandas as pd import matplotlib.pyplot as plt # Upload your Excel file (if not uploaded yet) # from google.colab import files # uploaded = files.upload() # This line is commented out to avoid re-uploading the file.  # Preview first few rows with new columns.  Print(\"Data Preview with parsed columns:\") print(df.head()) # --- Time Series Plot --- plt.figure(figsize=(10,6)) pl t.plot(df[\"X], label=\"X (uT)\") plt, show() 14.  References Adafruit HMC5883L Magnetometer Library Documentation Arduino Official Documentation (www.arduino.cc) Matplotlib & Pandas Official Python Libraries DS3231 RTC Datasheet SD Card Module Technical Guide 15.  3D magnetic field vectors Fig5. Generated by Book Summarizer AI",
    "word_count": 785
  }
]