[
  {
    "chunk_id": 1,
    "text": "World War II was a global conflict that lasted from 1939 to 1945 and involved most of the world s nations, including all major powers. It was primarily fought between the Allied Powers Britain, France, the Soviet Union, the United States, and China and the Axis Powers, led by Germany, Italy, and Japan. The war was caused by unresolved issues from World War I, the harsh Treaty of Versailles (1919), economic instability during the Great Depression, and the rise of aggressive nationalist regimes in Europe and Asia. The war officially began on 1 September 1939, when Germany invaded Poland using a rapid military strategy known as Blitzkrieg. In response, Britain and France declared war on Germany on 3 September 1939. By 1940, Germany had conquered Denmark, Norway, Belgium, the Netherlands, and France, forcing the British army to retreat at Dunkirk. The Battle of Britain (1940) marked the first major defeat of Hitler s air force. In June 1941, Germany launched Operation Barbarossa, invading the Soviet Union. This invasion opened the Eastern Front, which became the largest and bloodiest theatre of the war. The turning point came with the Battle of Stalingrad (1942 1943), where German forces suffered a decisive defeat. Meanwhile, in North Africa, Allied victories at El Alamein (1942) weakened Axis control. The war expanded into the Pacific after Japan attacked Pearl Harbor on 7 December 1941, bringing the United States into the war. Fierce battles followed, including Midway (1942) and Iwo Jima (1945). In Europe, the Allies launched D-Day on 6 June 1944, landing in Normandy and beginning the liberation of Western Europe. Germany surrendered on 8 May 1945, known as Victory in Europe Day. The war ended fully after Japan surrendered on 15 August 1945, following the atomic bombings of Hiroshima and Nagasaki. World War II caused an estimated 70 85 million deaths, widespread destruction, and led to the establishment of the United Nations in 1945 to prevent future global conflicts.",
    "word_count": 386
  }
]